<!-- placeholder-1 -->
```fish
terraform plan
```
<!-- placeholder-2 -->

<details><summary>Diff of 6 changes.</summary>

```diff
~ data.cloudinit_config.api will be read during apply
# (config refers to values not yet known)
! aws_autoscaling_group.api will be updated in-place
! aws_autoscaling_group.web will be updated in-place
! aws_instance.db must be replaced
! aws_launch_template.api will be updated in-place
! aws_launch_template.web will be updated in-place
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 1 to add, 4 to change, 1 to destroy.</br>

<!-- placeholder-4 -->
###### By @kohanyirobert at 2024-11-22T15:36:14Z [(view log)](https://github.com/kohanyirobert/example-infra/actions/runs/11975579655/job/33389267732#step::1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.cloudinit_config.api will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "api" {
      + base64_encode = false
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = <<-EOT
                #!/bin/bash
                dnf update -y
                dnf install -y docker
                systemctl enable --now docker
                usermod -aG docker ec2-user
                newgrp docker
            EOT
          + content_type = "text/x-shellscript"
          + filename     = "00-install-docker.sh"
        }
      + part {
          + content      = (known after apply)
          + content_type = "text/x-shellscript"
          + filename     = "01-deploy-api.sh"
        }
    }

  # aws_autoscaling_group.api will be updated in-place
  ~ resource "aws_autoscaling_group" "api" {
        id                               = "api-asg-2024112209294170320000000a"
        name                             = "api-asg-2024112209294170320000000a"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-021a88aa9519cf053"
            name    = "api-template"
          ~ version = "3" -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_autoscaling_group.web will be updated in-place
  ~ resource "aws_autoscaling_group" "web" {
        id                               = "web-asg-2024112209322844970000000c"
        name                             = "web-asg-2024112209322844970000000c"
        # (31 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-05e4fd30663e524fc"
            name    = "web-template"
          ~ version = "2" -> (known after apply)
        }

        # (4 unchanged blocks hidden)
    }

  # aws_instance.db must be replaced
-/+ resource "aws_instance" "db" {
      ~ arn                                  = "arn:aws:ec2:eu-central-1:047719633548:instance/i-072e993d7d87f56ff" -> (known after apply)
      ~ availability_zone                    = "eu-central-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-072e993d7d87f56ff" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-07dfb57e2e4d3777d" -> (known after apply)
      ~ private_dns                          = "ip-10-0-10-225.eu-central-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.10.225" -> (known after apply)
      + public_dns                           = (known after apply)
      ~ public_ip                            = "18.199.153.134" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
        tags                                 = {
            "Name"    = "main-db"
            "Project" = "main"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "367efddc47ee732f21004d6dff8bfa10fd24d9b7" -> "b774a67e57510bc71ec5199825501b7c1374e000" # forces replacement
      + user_data_base64                     = (known after apply)
        # (10 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 1 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options (known after apply)
      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_protocol_ipv6          = "disabled" -> null
          - http_put_response_hop_limit = 2 -> null
          - http_tokens                 = "required" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      ~ network_interface (known after apply)

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device (known after apply)
      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 3000 -> null
          - tags                  = {} -> null
          - tags_all              = {} -> null
          - throughput            = 125 -> null
          - volume_id             = "vol-07784f65b97d9947b" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp3" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # aws_launch_template.api will be updated in-place
  ~ resource "aws_launch_template" "api" {
        id                                   = "lt-021a88aa9519cf053"
      ~ latest_version                       = 3 -> (known after apply)
        name                                 = "api-template"
        tags                                 = {
            "Name"    = "main-api-template"
            "Project" = "main"
        }
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LURpc3Bvc2l0aW9uOiBhdHRhY2htZW50OyBmaWxlbmFtZT0iMDAtaW5zdGFsbC1kb2NrZXIuc2giDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQveC1zaGVsbHNjcmlwdA0KTWltZS1WZXJzaW9uOiAxLjANCg0KIyEvYmluL2Jhc2gKZG5mIHVwZGF0ZSAteQpkbmYgaW5zdGFsbCAteSBkb2NrZXIKc3lzdGVtY3RsIGVuYWJsZSAtLW5vdyBkb2NrZXIKdXNlcm1vZCAtYUcgZG9ja2VyIGVjMi11c2VyCm5ld2dycCBkb2NrZXIKDQotLU1JTUVCT1VOREFSWQ0KQ29udGVudC1EaXNwb3NpdGlvbjogYXR0YWNobWVudDsgZmlsZW5hbWU9IjAxLWRlcGxveS1hcGkuc2giDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQveC1zaGVsbHNjcmlwdA0KTWltZS1WZXJzaW9uOiAxLjANCg0KIyEvYmluL2Jhc2gKZGJfcGFzc3dvcmQ9JChhd3Mgc3NtIGdldC1wYXJhbWV0ZXIgLS1vdXRwdXQgdGV4dCAtLXF1ZXJ5IFBhcmFtZXRlci5WYWx1ZSAtLW5hbWUgZGJfcGFzc3dvcmQpCmltYWdlPWdoY3IuaW8va29oYW55aXJvYmVydC9leGFtcGxlLWFwaTpsYXRlc3QKZG9ja2VyIHB1bGwgJGltYWdlCmRvY2tlciBydW4gXAogIC0tbmFtZSBhcGkgXAogIC0tcHVibGlzaCA4MDo1MDAwIFwKICAtLWVudiBQR19VUkw9cG9zdGdyZXM6Ly9hcGk6JGRiX3Bhc3N3b3JkQDEwLjAuMTAuMjI1OjU0MzIvY2FycyBcCiAgLS1ybSBcCiAgLS1kZXRhY2ggXAogICRpbWFnZQoKdW50aWwgY3VybCAtLWZhaWwgaHR0cDovL2xvY2FsaG9zdC9hcGkvY2FycwpkbwogIGVjaG8gIldhaXRpbmcgZm9yIHRoZSBhcGksIHJldHJ5aW5nIGluIDMgc2Vjb25kcy4uLiIKICBzbGVlcCAzCmRvbmUKDQotLU1JTUVCT1VOREFSWS0tDQo=" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_launch_template.web will be updated in-place
  ~ resource "aws_launch_template" "web" {
        id                                   = "lt-05e4fd30663e524fc"
      ~ latest_version                       = 2 -> (known after apply)
        name                                 = "web-template"
        tags                                 = {
            "Name"    = "main-web-template"
            "Project" = "main"
        }
      ~ user_data                            = "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LURpc3Bvc2l0aW9uOiBhdHRhY2htZW50OyBmaWxlbmFtZT0iMDAtaW5zdGFsbC1kb2NrZXIuc2giDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQveC1zaGVsbHNjcmlwdA0KTWltZS1WZXJzaW9uOiAxLjANCg0KIyEvYmluL2Jhc2gKZG5mIHVwZGF0ZSAteQpkbmYgaW5zdGFsbCAteSBkb2NrZXIKc3lzdGVtY3RsIGVuYWJsZSAtLW5vdyBkb2NrZXIKdXNlcm1vZCAtYUcgZG9ja2VyIGVjMi11c2VyCm5ld2dycCBkb2NrZXIKDQotLU1JTUVCT1VOREFSWQ0KQ29udGVudC1EaXNwb3NpdGlvbjogYXR0YWNobWVudDsgZmlsZW5hbWU9IjAxLWRlcGxveS13ZWIuc2giDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQveC1zaGVsbHNjcmlwdA0KTWltZS1WZXJzaW9uOiAxLjANCg0KIyEvYmluL2Jhc2gKaW1hZ2U9Z2hjci5pby9rb2hhbnlpcm9iZXJ0L2V4YW1wbGUtd2ViOmxhdGVzdApkb2NrZXIgcHVsbCAkaW1hZ2UKZG9ja2VyIHJ1biBcCiAgLS1uYW1lIHdlYiBcCiAgLS1wdWJsaXNoIDgwOjcwMDAgXAogIC0tZW52IFZJVEVfUFJPWFk9aHR0cDovL2ludGVybmFsLWFwaS1sYi0zMzQ2ODExNzAuZXUtY2VudHJhbC0xLmVsYi5hbWF6b25hd3MuY29tIFwKICAtLXJtIFwKICAtLWRldGFjaCBcCiAgJGltYWdlCgp1bnRpbCBjdXJsIC0tZmFpbCBodHRwOi8vbG9jYWxob3N0CmRvCiAgZWNobyAiV2FpdGluZyBmb3IgdGhlIHdlYiwgcmV0cnlpbmcgaW4gMyBzZWNvbmRzLi4uIgogIHNsZWVwIDMKZG9uZQoNCi0tTUlNRUJPVU5EQVJZLS0NCg==" -> "Q29udGVudC1UeXBlOiBtdWx0aXBhcnQvbWl4ZWQ7IGJvdW5kYXJ5PSJNSU1FQk9VTkRBUlkiCk1JTUUtVmVyc2lvbjogMS4wDQoNCi0tTUlNRUJPVU5EQVJZDQpDb250ZW50LURpc3Bvc2l0aW9uOiBhdHRhY2htZW50OyBmaWxlbmFtZT0iMDAtaW5zdGFsbC1kb2NrZXIuc2giDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQveC1zaGVsbHNjcmlwdA0KTWltZS1WZXJzaW9uOiAxLjANCg0KIyEvYmluL2Jhc2gKZG5mIHVwZGF0ZSAteQpkbmYgaW5zdGFsbCAteSBkb2NrZXIKc3lzdGVtY3RsIGVuYWJsZSAtLW5vdyBkb2NrZXIKdXNlcm1vZCAtYUcgZG9ja2VyIGVjMi11c2VyCm5ld2dycCBkb2NrZXIKDQotLU1JTUVCT1VOREFSWQ0KQ29udGVudC1EaXNwb3NpdGlvbjogYXR0YWNobWVudDsgZmlsZW5hbWU9IjAxLWRlcGxveS13ZWIuc2giDQpDb250ZW50LVRyYW5zZmVyLUVuY29kaW5nOiA3Yml0DQpDb250ZW50LVR5cGU6IHRleHQveC1zaGVsbHNjcmlwdA0KTWltZS1WZXJzaW9uOiAxLjANCg0KIyEvYmluL2Jhc2gKaG9zdG5hbWU9JChob3N0bmFtZSkKaW1hZ2U9Z2hjci5pby9rb2hhbnlpcm9iZXJ0L2V4YW1wbGUtd2ViOmxhdGVzdApkb2NrZXIgcHVsbCAkaW1hZ2UKZG9ja2VyIHJ1biBcCiAgLS1uYW1lIHdlYiBcCiAgLS1wdWJsaXNoIDgwOjcwMDAgXAogIC0tZW52IEVDMl9IT1NUTkFNRT0kaG9zdG5hbWUgXAogIC0tZW52IFZJVEVfUFJPWFk9aHR0cDovL2ludGVybmFsLWFwaS1sYi0zMzQ2ODExNzAuZXUtY2VudHJhbC0xLmVsYi5hbWF6b25hd3MuY29tIFwKICAtLXJtIFwKICAtLWRldGFjaCBcCiAgJGltYWdlCgp1bnRpbCBjdXJsIC0tZmFpbCBodHRwOi8vbG9jYWxob3N0CmRvCiAgZWNobyAiV2FpdGluZyBmb3IgdGhlIHdlYiwgcmV0cnlpbmcgaW4gMyBzZWNvbmRzLi4uIgogIHNsZWVwIDMKZG9uZQoNCi0tTUlNRUJPVU5EQVJZLS0NCg=="
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-4-a9422b584118f6d71f77b7807de4e5ad.tfplan -->
<!-- placeholder-6 -->